; domain
;; source: https://github.com/AI-Planning/pddl-generators/blob/main/rovers/domain.pddl
;; updates:
;;   - since actions are performed sequentially and immediately
;;     'channel_free' and 'available' predicates are removed
;;   -

(define (domain rover)
(:requirements :strips :typing)
(:types rover waypoint store camera mode lander objective)

(:predicates
    (at ?x - rover ?y - waypoint)
    (at_lander ?x - lander ?y - waypoint)
    (can_traverse ?r - rover ?x - waypoint ?y - waypoint)
	(equipped_for_soil_analysis ?r - rover)
    (equipped_for_rock_analysis ?r - rover)
    (equipped_for_imaging ?r - rover)
    (empty ?s - store)
    (have_rock_analysis ?r - rover ?w - waypoint)
    (have_soil_analysis ?r - rover ?w - waypoint)
    (full ?s - store)
	(calibrated ?c - camera ?r - rover)
	(supports ?c - camera ?m - mode)
    (visible ?w - waypoint ?p - waypoint)
    (have_image ?r - rover ?o - objective ?m - mode)
    (communicated_soil_data ?w - waypoint)
    (communicated_rock_data ?w - waypoint)
    (communicated_image_data ?o - objective ?m - mode)
	(at_soil_sample ?w - waypoint)
	(at_rock_sample ?w - waypoint)
    (visible_from ?o - objective ?w - waypoint)
	(store_of ?s - store ?r - rover)
	(calibration_target ?i - camera ?o - objective)
	(on_board ?i - camera ?r - rover)
)

(:action navigate
:parameters (?x - rover ?y - waypoint ?z - waypoint)
:precondition (and
    ; (can_traverse ?x ?y ?z)
    (at ?x ?y)
    ; (visible ?y ?z)
    )
:effect (and
    (not (at ?x ?y))
    (at ?x ?z))
)

(:action sample_soil
:parameters (?x - rover ?s - store ?p - waypoint)
:precondition (and
    (at ?x ?p)
    (at_soil_sample ?p)
	(equipped_for_soil_analysis ?x)
	(store_of ?s ?x)
	(empty ?s))
:effect (and
    (not (empty ?s))
    (full ?s)
    (have_soil_analysis ?x ?p)
    (not (at_soil_sample ?p)))
)

(:action sample_rock
:parameters (?x - rover ?s - store ?p - waypoint)
:precondition (and
    (at ?x ?p)
    (at_rock_sample ?p)
	(equipped_for_rock_analysis ?x)
	(store_of ?s ?x)
	(empty ?s))
:effect (and
    (not (empty ?s))
    (full ?s)
    (have_rock_analysis ?x ?p)
	(not (at_rock_sample ?p)))
)

(:action drop
:parameters (?x - rover ?y - store)
:precondition (and
    (store_of ?y ?x)
    (full ?y))
:effect (and
    (not (full ?y))
    (empty ?y))
)

(:action calibrate
 :parameters (?r - rover ?i - camera ?t - objective ?w - waypoint)
 :precondition (and
    (equipped_for_imaging ?r)
    (calibration_target ?i ?t)
    (at ?r ?w)
    (visible_from ?t ?w)
    (on_board ?i ?r))
 :effect (and
    (calibrated ?i ?r))
)

(:action take_image
 :parameters (?r - rover ?p - waypoint ?o - objective ?i - camera ?m - mode)
 :precondition (and
    (calibrated ?i ?r)
    (on_board ?i ?r)
    (equipped_for_imaging ?r)
    (supports ?i ?m)
    (visible_from ?o ?p)
    (at ?r ?p))
 :effect (and
    (have_image ?r ?o ?m)
    (not (calibrated ?i ?r)))
)

(:action communicate_soil_data
 :parameters (?r - rover ?l - lander ?p - waypoint ?x - waypoint ?y - waypoint)
 :precondition (and
    (at ?r ?x)
    (at_lander ?l ?y)
    (have_soil_analysis ?r ?p)
    (visible ?x ?y))
 :effect (and
    (communicated_soil_data ?p))
)

(:action communicate_rock_data
 :parameters (?r - rover ?l - lander ?p - waypoint ?x - waypoint ?y - waypoint)
 :precondition (and
    (at ?r ?x)
    (at_lander ?l ?y)
    (have_rock_analysis ?r ?p)
    (visible ?x ?y))
 :effect (and
    (communicated_rock_data ?p))
)

(:action communicate_image_data
 :parameters (?r - rover ?l - lander ?o - objective ?m - mode
	      ?x - waypoint ?y - waypoint)
 :precondition (and
    (at ?r ?x)
    (at_lander ?l ?y)
    (have_image ?r ?o ?m)
    (visible ?x ?y))
 :effect (and
    (communicated_image_data ?o ?m)))
)

; problem
;; rovers=3, waypoints=8, cameras=3, objectives=7, out_folder=training/easy, instance_id=72, seed=107

(define (problem rover-72)
 (:domain rover)
 (:objects 
    general - lander
    colour high_res low_res - mode
    rover1 rover2 rover3 - rover
    rover1store rover2store rover3store - store
    waypoint1 waypoint2 waypoint3 waypoint4 waypoint5 waypoint6 waypoint7 waypoint8 - waypoint
    camera1 camera2 camera3 - camera
    objective1 objective2 objective3 objective4 objective5 objective6 objective7 - objective)
 (:init 
    (at_lander general waypoint4)
    (at rover1 waypoint7)
    (at rover2 waypoint8)
    (at rover3 waypoint5)
    (equipped_for_soil_analysis rover3)
    (equipped_for_soil_analysis rover2)
    (equipped_for_soil_analysis rover1)
    (equipped_for_rock_analysis rover1)
    (equipped_for_rock_analysis rover2)
    (equipped_for_imaging rover2)
    (equipped_for_imaging rover1)
    (equipped_for_imaging rover3)
    (empty rover1store)
    (empty rover2store)
    (empty rover3store)
    (store_of rover1store rover1)
    (store_of rover2store rover2)
    (store_of rover3store rover3)
    (at_rock_sample waypoint3)
    (at_rock_sample waypoint4)
    (at_rock_sample waypoint5)
    (at_rock_sample waypoint6)
    (at_rock_sample waypoint7)
    (at_rock_sample waypoint8)
    (at_soil_sample waypoint2)
    (at_soil_sample waypoint3)
    (at_soil_sample waypoint4)
    (at_soil_sample waypoint5)
    (at_soil_sample waypoint7)
    (at_soil_sample waypoint8)
    (visible waypoint3 waypoint8)
    (visible waypoint7 waypoint1)
    (visible waypoint6 waypoint5)
    (visible waypoint4 waypoint6)
    (visible waypoint6 waypoint4)
    (visible waypoint5 waypoint7)
    (visible waypoint1 waypoint7)
    (visible waypoint8 waypoint3)
    (visible waypoint5 waypoint6)
    (visible waypoint5 waypoint3)
    (visible waypoint7 waypoint5)
    (visible waypoint2 waypoint5)
    (visible waypoint3 waypoint5)
    (visible waypoint5 waypoint2)
    (visible waypoint1 waypoint4)
    (visible waypoint4 waypoint1)
    (visible waypoint1 waypoint2)
    (visible waypoint2 waypoint1)
    (visible waypoint3 waypoint7)
    (visible waypoint7 waypoint3)
    (visible waypoint2 waypoint3)
    (visible waypoint3 waypoint2)
    (visible waypoint5 waypoint8)
    (visible waypoint8 waypoint5)
    (visible waypoint2 waypoint6)
    (visible waypoint6 waypoint2)
    (visible waypoint6 waypoint8)
    (visible waypoint8 waypoint6)
    (visible waypoint3 waypoint4)
    (visible waypoint4 waypoint3)
    (visible waypoint1 waypoint6)
    (visible waypoint6 waypoint1)
    (can_traverse rover1 waypoint3 waypoint8)
    (can_traverse rover1 waypoint7 waypoint1)
    (can_traverse rover1 waypoint6 waypoint5)
    (can_traverse rover1 waypoint4 waypoint6)
    (can_traverse rover1 waypoint6 waypoint4)
    (can_traverse rover1 waypoint5 waypoint7)
    (can_traverse rover1 waypoint1 waypoint7)
    (can_traverse rover1 waypoint8 waypoint3)
    (can_traverse rover1 waypoint5 waypoint6)
    (can_traverse rover1 waypoint5 waypoint3)
    (can_traverse rover1 waypoint7 waypoint5)
    (can_traverse rover1 waypoint2 waypoint5)
    (can_traverse rover1 waypoint3 waypoint5)
    (can_traverse rover1 waypoint5 waypoint2)
    (can_traverse rover1 waypoint2 waypoint3)
    (can_traverse rover1 waypoint3 waypoint2)
    (can_traverse rover1 waypoint6 waypoint8)
    (can_traverse rover1 waypoint8 waypoint6)
    (can_traverse rover2 waypoint3 waypoint8)
    (can_traverse rover2 waypoint7 waypoint1)
    (can_traverse rover2 waypoint6 waypoint5)
    (can_traverse rover2 waypoint4 waypoint6)
    (can_traverse rover2 waypoint6 waypoint4)
    (can_traverse rover2 waypoint5 waypoint7)
    (can_traverse rover2 waypoint1 waypoint7)
    (can_traverse rover2 waypoint8 waypoint3)
    (can_traverse rover2 waypoint5 waypoint6)
    (can_traverse rover2 waypoint5 waypoint3)
    (can_traverse rover2 waypoint7 waypoint5)
    (can_traverse rover2 waypoint2 waypoint5)
    (can_traverse rover2 waypoint3 waypoint5)
    (can_traverse rover2 waypoint5 waypoint2)
    (can_traverse rover2 waypoint1 waypoint2)
    (can_traverse rover2 waypoint2 waypoint1)
    (can_traverse rover3 waypoint3 waypoint8)
    (can_traverse rover3 waypoint7 waypoint1)
    (can_traverse rover3 waypoint6 waypoint5)
    (can_traverse rover3 waypoint4 waypoint6)
    (can_traverse rover3 waypoint6 waypoint4)
    (can_traverse rover3 waypoint5 waypoint7)
    (can_traverse rover3 waypoint1 waypoint7)
    (can_traverse rover3 waypoint8 waypoint3)
    (can_traverse rover3 waypoint5 waypoint6)
    (can_traverse rover3 waypoint5 waypoint3)
    (can_traverse rover3 waypoint7 waypoint5)
    (can_traverse rover3 waypoint2 waypoint5)
    (can_traverse rover3 waypoint3 waypoint5)
    (can_traverse rover3 waypoint5 waypoint2)
    (can_traverse rover3 waypoint1 waypoint6)
    (can_traverse rover3 waypoint6 waypoint1)
    (calibration_target camera1 objective4)
    (on_board camera1 rover3)
    (supports camera1 colour)
    (supports camera1 low_res)
    (supports camera1 high_res)
    (calibration_target camera2 objective6)
    (on_board camera2 rover1)
    (supports camera2 high_res)
    (supports camera2 colour)
    (calibration_target camera3 objective2)
    (on_board camera3 rover2)
    (supports camera3 high_res)
    (visible_from objective1 waypoint5)
    (visible_from objective2 waypoint2)
    (visible_from objective2 waypoint7)
    (visible_from objective2 waypoint5)
    (visible_from objective3 waypoint8)
    (visible_from objective4 waypoint1)
    (visible_from objective4 waypoint6)
    (visible_from objective4 waypoint4)
    (visible_from objective4 waypoint3)
    (visible_from objective4 waypoint7)
    (visible_from objective4 waypoint5)
    (visible_from objective4 waypoint8)
    (visible_from objective5 waypoint2)
    (visible_from objective5 waypoint4)
    (visible_from objective5 waypoint3)
    (visible_from objective5 waypoint7)
    (visible_from objective5 waypoint6)
    (visible_from objective5 waypoint5)
    (visible_from objective6 waypoint1)
    (visible_from objective6 waypoint3)
    (visible_from objective6 waypoint5)
    (visible_from objective7 waypoint3)
    (visible_from objective7 waypoint8)
    (visible_from objective7 waypoint2)
    (visible_from objective7 waypoint5)
    (visible_from objective7 waypoint1)
    (visible_from objective7 waypoint6)
    (visible_from objective7 waypoint7)
    (visible_from objective7 waypoint4))
 (:goal  (and 
    (communicated_rock_data waypoint3)
    (communicated_rock_data waypoint8)
    (communicated_rock_data waypoint4)
    (communicated_rock_data waypoint5)
    (communicated_rock_data waypoint7)
    (communicated_soil_data waypoint2)
    (communicated_image_data objective7 colour)
    (communicated_image_data objective2 low_res)
    (communicated_image_data objective4 low_res)
    (communicated_image_data objective3 colour)
    (communicated_image_data objective3 low_res)
    (communicated_image_data objective5 low_res)
    (communicated_image_data objective1 low_res)
    (communicated_image_data objective6 low_res)
    (communicated_image_data objective4 high_res)
    (communicated_image_data objective2 high_res)
    (communicated_image_data objective6 high_res)
    (communicated_image_data objective7 low_res)
    (communicated_image_data objective4 colour)
    (communicated_image_data objective6 colour)
    (communicated_image_data objective1 colour))))

; plan
1. (navigate rover3 waypoint5 waypoint2)
   deleted: (at rover3 waypoint5)
   added: (at rover3 waypoint2)
   goals met: 0 of 21
2. (sample_soil rover3 rover3store waypoint2)
   deleted: (empty rover3store) (at_soil_sample waypoint2)
   added: (full rover3store) (have_soil_analysis rover3 waypoint2)
   goals met: 0 of 21
3. (drop rover3 rover3store)
   deleted: (full rover3store)
   added: (empty rover3store)
   goals met: 0 of 21
4. (navigate rover3 waypoint2 waypoint5)
   deleted: (at rover3 waypoint2)
   added: (at rover3 waypoint5)
   goals met: 0 of 21
5. (navigate rover3 waypoint5 waypoint6)
   deleted: (at rover3 waypoint5)
   added: (at rover3 waypoint6)
   goals met: 0 of 21
6. (communicate_soil_data rover3 general waypoint2 waypoint6 waypoint4)
   added: (communicated_soil_data waypoint2)
   goals met: 1 of 21
7. (navigate rover1 waypoint7 waypoint5)
   deleted: (at rover1 waypoint7)
   added: (at rover1 waypoint5)
   goals met: 1 of 21
8. (navigate rover1 waypoint5 waypoint3)
   deleted: (at rover1 waypoint5)
   added: (at rover1 waypoint3)
   goals met: 1 of 21
9. (sample_rock rover1 rover1store waypoint3)
   deleted: (empty rover1store) (at_rock_sample waypoint3)
   added: (full rover1store) (have_rock_analysis rover1 waypoint3)
   goals met: 1 of 21
10. (drop rover1 rover1store)
   deleted: (full rover1store)
   added: (empty rover1store)
   goals met: 1 of 21
11. (communicate_rock_data rover1 general waypoint3 waypoint3 waypoint4)
   added: (communicated_rock_data waypoint3)
   goals met: 2 of 21
12. (navigate rover1 waypoint3 waypoint8)
   deleted: (at rover1 waypoint3)
   added: (at rover1 waypoint8)
   goals met: 2 of 21
13. (sample_rock rover1 rover1store waypoint8)
   deleted: (empty rover1store) (at_rock_sample waypoint8)
   added: (full rover1store) (have_rock_analysis rover1 waypoint8)
   goals met: 2 of 21
14. (drop rover1 rover1store)
   deleted: (full rover1store)
   added: (empty rover1store)
   goals met: 2 of 21
15. (navigate rover1 waypoint8 waypoint6)
   deleted: (at rover1 waypoint8)
   added: (at rover1 waypoint6)
   goals met: 2 of 21
16. (communicate_rock_data rover1 general waypoint8 waypoint6 waypoint4)
   added: (communicated_rock_data waypoint8)
   goals met: 3 of 21
17. (navigate rover1 waypoint6 waypoint4)
   deleted: (at rover1 waypoint6)
   added: (at rover1 waypoint4)
   goals met: 3 of 21
18. (sample_rock rover1 rover1store waypoint4)
   deleted: (empty rover1store) (at_rock_sample waypoint4)
   added: (full rover1store) (have_rock_analysis rover1 waypoint4)
   goals met: 3 of 21
19. (drop rover1 rover1store)
   deleted: (full rover1store)
   added: (empty rover1store)
   goals met: 3 of 21
20. (navigate rover1 waypoint4 waypoint6)
   deleted: (at rover1 waypoint4)
   added: (at rover1 waypoint6)
   goals met: 3 of 21
21. (communicate_rock_data rover1 general waypoint4 waypoint6 waypoint4)
   added: (communicated_rock_data waypoint4)
   goals met: 4 of 21
22. (navigate rover1 waypoint6 waypoint5)
   deleted: (at rover1 waypoint6)
   added: (at rover1 waypoint5)
   goals met: 4 of 21
23. (sample_rock rover1 rover1store waypoint5)
   deleted: (empty rover1store) (at_rock_sample waypoint5)
   added: (full rover1store) (have_rock_analysis rover1 waypoint5)
   goals met: 4 of 21
24. (drop rover1 rover1store)
   deleted: (full rover1store)
   added: (empty rover1store)
   goals met: 4 of 21
25. (navigate rover1 waypoint5 waypoint6)
   deleted: (at rover1 waypoint5)
   added: (at rover1 waypoint6)
   goals met: 4 of 21
26. (communicate_rock_data rover1 general waypoint5 waypoint6 waypoint4)
   added: (communicated_rock_data waypoint5)
   goals met: 5 of 21
27. (navigate rover1 waypoint6 waypoint5)
   deleted: (at rover1 waypoint6)
   added: (at rover1 waypoint5)
   goals met: 5 of 21
28. (navigate rover1 waypoint5 waypoint7)
   deleted: (at rover1 waypoint5)
   added: (at rover1 waypoint7)
   goals met: 5 of 21
29. (sample_rock rover1 rover1store waypoint7)
   deleted: (empty rover1store) (at_rock_sample waypoint7)
   added: (full rover1store) (have_rock_analysis rover1 waypoint7)
   goals met: 5 of 21
30. (drop rover1 rover1store)
   deleted: (full rover1store)
   added: (empty rover1store)
   goals met: 5 of 21
31. (navigate rover1 waypoint7 waypoint1)
   deleted: (at rover1 waypoint7)
   added: (at rover1 waypoint1)
   goals met: 5 of 21
32. (communicate_rock_data rover1 general waypoint7 waypoint1 waypoint4)
   added: (communicated_rock_data waypoint7)
   goals met: 6 of 21
33. (calibrate rover1 camera2 objective6 waypoint1)
   added: (calibrated camera2 rover1)
   goals met: 6 of 21
34. (take_image rover1 waypoint1 objective7 camera2 colour)
   deleted: (calibrated camera2 rover1)
   added: (have_image rover1 objective7 colour)
   goals met: 6 of 21
35. (communicate_image_data rover1 general objective7 colour waypoint1 waypoint4)
   added: (communicated_image_data objective7 colour)
   goals met: 7 of 21
36. (calibrate rover3 camera1 objective4 waypoint6)
   added: (calibrated camera1 rover3)
   goals met: 7 of 21
37. (navigate rover3 waypoint6 waypoint5)
   deleted: (at rover3 waypoint6)
   added: (at rover3 waypoint5)
   goals met: 7 of 21
38. (take_image rover3 waypoint5 objective2 camera1 low_res)
   deleted: (calibrated camera1 rover3)
   added: (have_image rover3 objective2 low_res)
   goals met: 7 of 21
39. (navigate rover3 waypoint5 waypoint6)
   deleted: (at rover3 waypoint5)
   added: (at rover3 waypoint6)
   goals met: 7 of 21
40. (communicate_image_data rover3 general objective2 low_res waypoint6 waypoint4)
   added: (communicated_image_data objective2 low_res)
   goals met: 8 of 21
41. (calibrate rover3 camera1 objective4 waypoint6)
   added: (calibrated camera1 rover3)
   goals met: 8 of 21
42. (take_image rover3 waypoint6 objective4 camera1 low_res)
   deleted: (calibrated camera1 rover3)
   added: (have_image rover3 objective4 low_res)
   goals met: 8 of 21
43. (communicate_image_data rover3 general objective4 low_res waypoint6 waypoint4)
   added: (communicated_image_data objective4 low_res)
   goals met: 9 of 21
44. (calibrate rover1 camera2 objective6 waypoint1)
   added: (calibrated camera2 rover1)
   goals met: 9 of 21
45. (navigate rover1 waypoint1 waypoint7)
   deleted: (at rover1 waypoint1)
   added: (at rover1 waypoint7)
   goals met: 9 of 21
46. (navigate rover1 waypoint7 waypoint5)
   deleted: (at rover1 waypoint7)
   added: (at rover1 waypoint5)
   goals met: 9 of 21
47. (navigate rover1 waypoint5 waypoint6)
   deleted: (at rover1 waypoint5)
   added: (at rover1 waypoint6)
   goals met: 9 of 21
48. (navigate rover1 waypoint6 waypoint8)
   deleted: (at rover1 waypoint6)
   added: (at rover1 waypoint8)
   goals met: 9 of 21
49. (take_image rover1 waypoint8 objective3 camera2 colour)
   deleted: (calibrated camera2 rover1)
   added: (have_image rover1 objective3 colour)
   goals met: 9 of 21
50. (navigate rover1 waypoint8 waypoint6)
   deleted: (at rover1 waypoint8)
   added: (at rover1 waypoint6)
   goals met: 9 of 21
51. (communicate_image_data rover1 general objective3 colour waypoint6 waypoint4)
   added: (communicated_image_data objective3 colour)
   goals met: 10 of 21
52. (calibrate rover3 camera1 objective4 waypoint6)
   added: (calibrated camera1 rover3)
   goals met: 10 of 21
53. (navigate rover3 waypoint6 waypoint5)
   deleted: (at rover3 waypoint6)
   added: (at rover3 waypoint5)
   goals met: 10 of 21
54. (navigate rover3 waypoint5 waypoint3)
   deleted: (at rover3 waypoint5)
   added: (at rover3 waypoint3)
   goals met: 10 of 21
55. (navigate rover3 waypoint3 waypoint8)
   deleted: (at rover3 waypoint3)
   added: (at rover3 waypoint8)
   goals met: 10 of 21
56. (take_image rover3 waypoint8 objective3 camera1 low_res)
   deleted: (calibrated camera1 rover3)
   added: (have_image rover3 objective3 low_res)
   goals met: 10 of 21
57. (navigate rover3 waypoint8 waypoint3)
   deleted: (at rover3 waypoint8)
   added: (at rover3 waypoint3)
   goals met: 10 of 21
58. (communicate_image_data rover3 general objective3 low_res waypoint3 waypoint4)
   added: (communicated_image_data objective3 low_res)
   goals met: 11 of 21
59. (calibrate rover3 camera1 objective4 waypoint3)
   added: (calibrated camera1 rover3)
   goals met: 11 of 21
60. (take_image rover3 waypoint3 objective5 camera1 low_res)
   deleted: (calibrated camera1 rover3)
   added: (have_image rover3 objective5 low_res)
   goals met: 11 of 21
61. (communicate_image_data rover3 general objective5 low_res waypoint3 waypoint4)
   added: (communicated_image_data objective5 low_res)
   goals met: 12 of 21
62. (calibrate rover3 camera1 objective4 waypoint3)
   added: (calibrated camera1 rover3)
   goals met: 12 of 21
63. (navigate rover3 waypoint3 waypoint5)
   deleted: (at rover3 waypoint3)
   added: (at rover3 waypoint5)
   goals met: 12 of 21
64. (take_image rover3 waypoint5 objective1 camera1 low_res)
   deleted: (calibrated camera1 rover3)
   added: (have_image rover3 objective1 low_res)
   goals met: 12 of 21
65. (navigate rover3 waypoint5 waypoint6)
   deleted: (at rover3 waypoint5)
   added: (at rover3 waypoint6)
   goals met: 12 of 21
66. (communicate_image_data rover3 general objective1 low_res waypoint6 waypoint4)
   added: (communicated_image_data objective1 low_res)
   goals met: 13 of 21
67. (calibrate rover3 camera1 objective4 waypoint6)
   added: (calibrated camera1 rover3)
   goals met: 13 of 21
68. (navigate rover3 waypoint6 waypoint5)
   deleted: (at rover3 waypoint6)
   added: (at rover3 waypoint5)
   goals met: 13 of 21
69. (take_image rover3 waypoint5 objective6 camera1 low_res)
   deleted: (calibrated camera1 rover3)
   added: (have_image rover3 objective6 low_res)
   goals met: 13 of 21
70. (navigate rover3 waypoint5 waypoint6)
   deleted: (at rover3 waypoint5)
   added: (at rover3 waypoint6)
   goals met: 13 of 21
71. (communicate_image_data rover3 general objective6 low_res waypoint6 waypoint4)
   added: (communicated_image_data objective6 low_res)
   goals met: 14 of 21
72. (navigate rover2 waypoint8 waypoint3)
   deleted: (at rover2 waypoint8)
   added: (at rover2 waypoint3)
   goals met: 14 of 21
73. (navigate rover2 waypoint3 waypoint5)
   deleted: (at rover2 waypoint3)
   added: (at rover2 waypoint5)
   goals met: 14 of 21
74. (calibrate rover2 camera3 objective2 waypoint5)
   added: (calibrated camera3 rover2)
   goals met: 14 of 21
75. (take_image rover2 waypoint5 objective4 camera3 high_res)
   deleted: (calibrated camera3 rover2)
   added: (have_image rover2 objective4 high_res)
   goals met: 14 of 21
76. (navigate rover2 waypoint5 waypoint6)
   deleted: (at rover2 waypoint5)
   added: (at rover2 waypoint6)
   goals met: 14 of 21
77. (communicate_image_data rover2 general objective4 high_res waypoint6 waypoint4)
   added: (communicated_image_data objective4 high_res)
   goals met: 15 of 21
78. (navigate rover2 waypoint6 waypoint5)
   deleted: (at rover2 waypoint6)
   added: (at rover2 waypoint5)
   goals met: 15 of 21
79. (calibrate rover2 camera3 objective2 waypoint5)
   added: (calibrated camera3 rover2)
   goals met: 15 of 21
80. (take_image rover2 waypoint5 objective2 camera3 high_res)
   deleted: (calibrated camera3 rover2)
   added: (have_image rover2 objective2 high_res)
   goals met: 15 of 21
81. (navigate rover2 waypoint5 waypoint6)
   deleted: (at rover2 waypoint5)
   added: (at rover2 waypoint6)
   goals met: 15 of 21
82. (communicate_image_data rover2 general objective2 high_res waypoint6 waypoint4)
   added: (communicated_image_data objective2 high_res)
   goals met: 16 of 21
83. (navigate rover2 waypoint6 waypoint5)
   deleted: (at rover2 waypoint6)
   added: (at rover2 waypoint5)
   goals met: 16 of 21
84. (calibrate rover2 camera3 objective2 waypoint5)
   added: (calibrated camera3 rover2)
   goals met: 16 of 21
85. (take_image rover2 waypoint5 objective6 camera3 high_res)
   deleted: (calibrated camera3 rover2)
   added: (have_image rover2 objective6 high_res)
   goals met: 16 of 21
86. (navigate rover2 waypoint5 waypoint6)
   deleted: (at rover2 waypoint5)
   added: (at rover2 waypoint6)
   goals met: 16 of 21
87. (communicate_image_data rover2 general objective6 high_res waypoint6 waypoint4)
   added: (communicated_image_data objective6 high_res)
   goals met: 17 of 21
88. (calibrate rover3 camera1 objective4 waypoint6)
   added: (calibrated camera1 rover3)
   goals met: 17 of 21
89. (take_image rover3 waypoint6 objective7 camera1 low_res)
   deleted: (calibrated camera1 rover3)
   added: (have_image rover3 objective7 low_res)
   goals met: 17 of 21
90. (communicate_image_data rover3 general objective7 low_res waypoint6 waypoint4)
   added: (communicated_image_data objective7 low_res)
   goals met: 18 of 21
91. (navigate rover1 waypoint6 waypoint5)
   deleted: (at rover1 waypoint6)
   added: (at rover1 waypoint5)
   goals met: 18 of 21
92. (calibrate rover1 camera2 objective6 waypoint5)
   added: (calibrated camera2 rover1)
   goals met: 18 of 21
93. (take_image rover1 waypoint5 objective4 camera2 colour)
   deleted: (calibrated camera2 rover1)
   added: (have_image rover1 objective4 colour)
   goals met: 18 of 21
94. (navigate rover1 waypoint5 waypoint6)
   deleted: (at rover1 waypoint5)
   added: (at rover1 waypoint6)
   goals met: 18 of 21
95. (communicate_image_data rover1 general objective4 colour waypoint6 waypoint4)
   added: (communicated_image_data objective4 colour)
   goals met: 19 of 21
96. (navigate rover1 waypoint6 waypoint5)
   deleted: (at rover1 waypoint6)
   added: (at rover1 waypoint5)
   goals met: 19 of 21
97. (calibrate rover1 camera2 objective6 waypoint5)
   added: (calibrated camera2 rover1)
   goals met: 19 of 21
98. (take_image rover1 waypoint5 objective6 camera2 colour)
   deleted: (calibrated camera2 rover1)
   added: (have_image rover1 objective6 colour)
   goals met: 19 of 21
99. (navigate rover1 waypoint5 waypoint6)
   deleted: (at rover1 waypoint5)
   added: (at rover1 waypoint6)
   goals met: 19 of 21
100. (communicate_image_data rover1 general objective6 colour waypoint6 waypoint4)
   added: (communicated_image_data objective6 colour)
   goals met: 20 of 21
101. (navigate rover1 waypoint6 waypoint5)
   deleted: (at rover1 waypoint6)
   added: (at rover1 waypoint5)
   goals met: 20 of 21
102. (calibrate rover1 camera2 objective6 waypoint5)
   added: (calibrated camera2 rover1)
   goals met: 20 of 21
103. (take_image rover1 waypoint5 objective1 camera2 colour)
   deleted: (calibrated camera2 rover1)
   added: (have_image rover1 objective1 colour)
   goals met: 20 of 21
104. (navigate rover1 waypoint5 waypoint6)
   deleted: (at rover1 waypoint5)
   added: (at rover1 waypoint6)
   goals met: 20 of 21
105. (communicate_image_data rover1 general objective1 colour waypoint6 waypoint4)
   added: (communicated_image_data objective1 colour)
   goals met: 21 of 21
